<template>
  <div class="slide-content" :class="{ 'active-slide': isActive }">
    <div class="gridImage" :class="{ 'animate-image': isActive }">
      <img src="@/img/slide4-1.png" alt="slide-4" class="rotate-slightly" />
    </div>
    <div class="gridInfo">
      <h2>
        <img class="superhero" src="@/img/superhero.png" alt="superhero" />
        Superhero mom
      </h2>
      <p>
        Мама - не супергерой. Но когда Лиза смотрит на тебя снизу вверх и видит
        супергероя — ты им становишься. Не потому что можешь всё, а потому что
        для неё — ты уже всё.
      </p>
      <p>
        И, наверное, именно в такие моменты мы лучше всего понимаем, кем нам
        <strong>действительно важно</strong> быть.
      </p>
    </div>
    <div class="link">
      <p>
        <a href="http://irinamoroz.ru">www.irinamoroz.ru</a>
      </p>
    </div>
  </div>
</template>

<script setup>
// Определяем проп isActive
defineProps({
  isActive: Boolean,
});
</script>

<style scoped>
/* Стилизация div за картинкой  */
.gridImage {
  border-radius: 71% 29% 55% 45% / 43% 74% 26% 57% !important;
  background: radial-gradient(
      at 67.4563731230842% 75.27956247105013%,
      hsla(9.557522123893806, 100%, 44.31372549019608%, 1) 0%,
      hsla(9.557522123893806, 100%, 44.31372549019608%, 0) 100%
    ),
    radial-gradient(
      at 34.91674492530111% 17.62369975610586%,
      hsla(59.047619047619044, 98.95287958115183%, 62.549019607843135%, 1) 0%,
      hsla(59.047619047619044, 98.95287958115183%, 62.549019607843135%, 0) 100%
    ),
    radial-gradient(
      at 57.474495796780644% 28.4250096378466%,
      hsla(93.65853658536584, 49.003984063745015%, 49.2156862745098%, 1) 0%,
      hsla(93.65853658536584, 49.003984063745015%, 49.2156862745098%, 0) 100%
    ),
    radial-gradient(
      at 67.36897233423927% 21.016020662280667%,
      hsla(192.66932270916334, 99.2094861660079%, 49.6078431372549%, 1) 0%,
      hsla(192.66932270916334, 99.2094861660079%, 49.6078431372549%, 0) 100%
    ),
    radial-gradient(
      at 98.14638050392516% 87.96950255369657%,
      hsla(215.88785046728972, 100%, 41.96078431372549%, 1) 0%,
      hsla(215.88785046728972, 100%, 41.96078431372549%, 0) 100%
    ),
    radial-gradient(
      at 9.736718715594572% 53.58423034985792%,
      hsla(9.557522123893806, 100%, 44.31372549019608%, 1) 0%,
      hsla(9.557522123893806, 100%, 44.31372549019608%, 0) 100%
    ),
    radial-gradient(
      at 4.132460399585236% 4.380040841139177%,
      hsla(59.047619047619044, 98.95287958115183%, 62.549019607843135%, 1) 0%,
      hsla(59.047619047619044, 98.95287958115183%, 62.549019607843135%, 0) 100%
    ),
    radial-gradient(
      at 59.95749978873967% 4.637491394106952%,
      hsla(93.65853658536584, 49.003984063745015%, 49.2156862745098%, 1) 0%,
      hsla(93.65853658536584, 49.003984063745015%, 49.2156862745098%, 0) 100%
    ),
    radial-gradient(
      at 4.182932002781936% 60.586653119861836%,
      hsla(192.66932270916334, 99.2094861660079%, 49.6078431372549%, 1) 0%,
      hsla(192.66932270916334, 99.2094861660079%, 49.6078431372549%, 0) 100%
    ),
    radial-gradient(
      at 26.000543869689697% 90.92075301335731%,
      hsla(215.88785046728972, 100%, 41.96078431372549%, 1) 0%,
      hsla(215.88785046728972, 100%, 41.96078431372549%, 0) 100%
    ),
    radial-gradient(
      at 88.63163940109496% 54.29471537827059%,
      hsla(9.557522123893806, 100%, 44.31372549019608%, 1) 0%,
      hsla(9.557522123893806, 100%, 44.31372549019608%, 0) 100%
    ),
    radial-gradient(
      at 39.30211970926359% 43.36054073914719%,
      hsla(59.047619047619044, 98.95287958115183%, 62.549019607843135%, 1) 0%,
      hsla(59.047619047619044, 98.95287958115183%, 62.549019607843135%, 0) 100%
    );
  margin: 5px 5px 0 5px;
  border-radius: 20px;
  grid-row: 1;
  background-color: #fdf2e5;

  img {
    object-fit: cover;
    border-radius: 20px;
    display: block;
    width: 100%;
  }
}

@keyframes slight-rotate {
  0% {
    transform: rotateZ(0deg);
  }
  50% {
    transform: rotateZ(1.5deg);
  }
  100% {
    transform: rotateZ(0deg);
  }
}

.rotate-slightly {
  animation: slight-rotate 10s ease-in-out infinite;
  transform-origin: center bottom;
}
</style>
